In [8]:
import pandas as pd 
import matplotlib.pyplot as plt

In [9]:
lg_features = pd.read_csv('data/lg_features.csv')
lg_features.sample(5)

,user_id,f_name,l_name,age,BY,RU,UA,D,USA,male,...,student,teacher,agriculture,military,automotive,fitness,craftmanship,music,hunting_fishing,num_looks_liked
9,25,Anna,Paddon,22,0,1,0,0,0,0,...,1,0,0,0,0,1,0,1,1,13
1,14,Anna,Walters,37,0,0,1,0,0,0,...,1,0,0,1,0,1,0,1,0,16
8,32,Anna,Cartman,33,0,0,0,1,0,0,...,0,0,0,1,1,0,0,0,1,13
3,6,Ali,Khamad,24,0,1,0,0,0,0,...,1,0,0,0,1,1,1,1,0,14
38,4,Jack,Woodson,41,0,0,0,0,1,1,...,1,0,0,0,0,1,0,0,1,8

In [10]:
lg_features = lg_features.dropna()

In [11]:
lg_features.shape

(40, 51)

In [12]:
lg_features.loc[lg_features['fitness'] == 1].count()

user_id            23
f_name             23
l_name             23
age                23
BY                 23
RU                 23
UA                 23
D                  23
USA                23
male               23
female             23
weight             23
height             23
chest              23
waist              23
hip                23
leg                23
red                23
blue               23
green              23
yellow             23
grey               23
white              23
black              23
style_1            23
style_2            23
style_3            23
style_4            23
style_5            23
H_M                23
Waikiki            23
Armani             23
Moncler            23
Gucci              23
Adidas             23
Nike               23
BOSS               23
Levi's             23
Kenzo              23
office             23
doctor             23
student            23
teacher            23
agriculture        23
military           23
automotive         23
fitness            23
craftmanship       23
music              23
hunting_fishing    23
num_looks_liked    23
dtype: int64

In [13]:
lg_features = lg_features.drop(lg_features.loc[lg_features['fitness'] > 1].index)

In [14]:
lg_features.shape

(40, 51)

In [15]:
lg_features.head()

,user_id,f_name,l_name,age,BY,RU,UA,D,USA,male,...,student,teacher,agriculture,military,automotive,fitness,craftmanship,music,hunting_fishing,num_looks_liked
0,33,Anna,Kenny,38,0,0,0,1,0,0,...,0,1,1,0,0,0,0,0,0,16
1,14,Anna,Walters,37,0,0,1,0,0,0,...,1,0,0,1,0,1,0,1,0,16
2,17,Anna,Woods,24,0,0,1,0,0,0,...,0,1,1,1,1,0,1,1,0,15
3,6,Ali,Khamad,24,0,1,0,0,0,0,...,1,0,0,0,1,1,1,1,0,14
4,30,Anna,Moore,43,0,0,0,0,1,0,...,1,1,0,0,0,1,1,1,1,14

In [18]:
lg_features['l_name'].unique()

array(['Kenny', 'Walters', 'Woods', 'Khamad', 'Moore', 'Swift', 'Bools',
       'Butler', 'Cartman', 'Paddon', 'Washington', 'Armstrong', 'Bets',
       'Jameson', 'Kennedy', 'Pen', 'Varaksa', 'Bandini', 'Doe', 'Dogg',
       'Fernandez', 'Johnson', 'Loeb', 'Pauls', 'Watson', 'Evans',
       'Stepton', 'Cole', 'Daniels', 'Mills', 'Ogier', 'Soronson',
       'Stockton', 'the Blondie', 'Holmes', 'Makovski', 'McCarthy',
       'Tollers', 'Woodson', 'Ballantines'], dtype=object)

In [19]:
lg_features = pd.get_dummies(lg_features, columns=['f_name', 'l_name'])

In [20]:
lg_features.shape

(40, 99)

In [23]:
lg_features.sample(5)

,user_id,age,BY,RU,UA,D,USA,male,female,weight,...,l_name_Stockton,l_name_Swift,l_name_Tollers,l_name_Varaksa,l_name_Walters,l_name_Washington,l_name_Watson,l_name_Woods,l_name_Woodson,l_name_the Blondie
8,32,33,0,0,0,1,0,0,1,82,...,0,0,0,0,0,0,0,0,0,0
28,12,23,1,0,0,0,0,0,1,55,...,0,0,0,0,0,0,0,0,0,0
33,2,38,0,0,0,1,0,0,1,63,...,0,0,0,0,0,0,0,0,0,1
1,14,37,0,0,1,0,0,0,1,89,...,0,0,0,0,1,0,0,0,0,0
31,7,28,1,0,0,0,0,0,1,56,...,0,0,0,0,0,0,0,0,0,0

In [25]:
median_weight = lg_features['weight'].median()
median_weight

75.0

In [26]:
lg_features['weight_above_median'] = (lg_features['weight'] - median_weight) > 0

In [27]:
lg_features.sample(5)

,user_id,age,BY,RU,UA,D,USA,male,female,weight,...,l_name_Swift,l_name_Tollers,l_name_Varaksa,l_name_Walters,l_name_Washington,l_name_Watson,l_name_Woods,l_name_Woodson,l_name_the Blondie,weight_above_median
23,36,48,0,0,0,1,0,0,1,56,...,0,0,0,0,0,0,0,0,0,False
3,6,24,0,1,0,0,0,0,1,55,...,0,0,0,0,0,0,0,0,0,False
1,14,37,0,0,1,0,0,0,1,89,...,0,0,0,1,0,0,0,0,0,True
5,40,58,1,0,0,0,0,0,1,87,...,1,0,0,0,0,0,0,0,0,True
7,16,61,1,0,0,0,0,0,1,73,...,0,0,0,0,0,0,0,0,0,False

In [28]:
X = lg_features.drop(['weight', 'weight_above_median'], axis=1)
Y = lg_features['weight_above_median']

In [29]:
X.columns

Index(['user_id', 'age', 'BY', 'RU', 'UA', 'D', 'USA', 'male', 'female',
       'height', 'chest', 'waist', 'hip', 'leg', 'red', 'blue', 'green',
       'yellow', 'grey', 'white', 'black', 'style_1', 'style_2', 'style_3',
       'style_4', 'style_5', 'H_M', 'Waikiki', 'Armani', 'Moncler', 'Gucci',
       'Adidas', 'Nike', 'BOSS', 'Levi's', 'Kenzo', 'office', 'doctor',
       'student', 'teacher', 'agriculture', 'military', 'automotive',
       'fitness', 'craftmanship', 'music', 'hunting_fishing',
       'num_looks_liked', 'f_name_Ali', 'f_name_Anna', 'f_name_Ben',
       'f_name_Jack', 'f_name_John', 'f_name_Lily', 'f_name_Linda',
       'f_name_Ruslan', 'f_name_Sean', 'f_name_Snoop', 'l_name_Armstrong',
       'l_name_Ballantines', 'l_name_Bandini', 'l_name_Bets', 'l_name_Bools',
       'l_name_Butler', 'l_name_Cartman', 'l_name_Cole', 'l_name_Daniels',
       'l_name_Doe', 'l_name_Dogg', 'l_name_Evans', 'l_name_Fernandez',
       'l_name_Holmes', 'l_name_Jameson', 'l_name_Johnson', 'l_name_Kennedy',
       'l_name_Kenny', 'l_name_Khamad', 'l_name_Loeb', 'l_name_Makovski',
       'l_name_McCarthy', 'l_name_Mills', 'l_name_Moore', 'l_name_Ogier',
       'l_name_Paddon', 'l_name_Pauls', 'l_name_Pen', 'l_name_Soronson',
       'l_name_Stepton', 'l_name_Stockton', 'l_name_Swift', 'l_name_Tollers',
       'l_name_Varaksa', 'l_name_Walters', 'l_name_Washington',
       'l_name_Watson', 'l_name_Woods', 'l_name_Woodson',
       'l_name_the Blondie'],
      dtype='object')

In [30]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2)

In [31]:
x_train.shape, x_test.shape

((32, 98), (8, 98))

In [32]:
from sklearn.linear_model import LogisticRegression
logistic_model = LogisticRegression(solver='liblinear').fit(x_train, y_train)

In [33]:
print('Training score: ', logistic_model.score(x_train, y_train))

Training score:  1.0

In [34]:
y_pred = logistic_model.predict(x_test)

In [39]:
df_pred_actual = pd.DataFrame({'predicted': y_pred, 'actual': y_test})
df_pred_actual.head(10)

    predicted  actual
17      False   False
11      False    True
38      False    True
8        True    True
29      False   False
14       True   False
13      False   False
3       False   False

In [40]:
from sklearn.metrics import accuracy_score
print('Accuracy score: ', accuracy_score(y_test, y_pred))

Accuracy score:  0.625